Revit 2024 API
AnalyticalDistributionNodePropertyData.NumberOfPhases Property
 The number of phases.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2023
Syntax
C#
public int NumberOfPhases { get; }
Visual Basic
Public ReadOnly Property NumberOfPhases As Integer
	Get
Visual C++
public:
property int NumberOfPhases {
	int get ();
}
See Also
AnalyticalDistributionNodePropertyData Class
Autodesk.Revit.DB.Electrical Namespace